stupid_list = """1 	Москва 	11 514 330
2 	Санкт-Петербург 	4 848 742
3 	Новосибирск 	1 498 921
4 	Екатеринбург 	1 377 738
5 	Нижний Новгород 	1 250 615
6 	Самара 	1 164 900
7 	Омск 	1 154 000
8 	Казань 	1 143 546
9 	Челябинск 	1 130 273
10 	Ростов-на-Дону 	1 091 544
11 	Уфа 	1 062 300
12 	Волгоград 	1 021 244
13 	Пермь 	1 000 679
14 	Красноярск 	973 826
15 	Воронеж 	889 680
16 	Саратов 	836 900
17 	Краснодар 	744 933
18 	Тольятти 	719 484
19 	Ижевск 	628 117
20 	Ульяновск 	613 793
21 	Барнаул 	612 091
22 	Владивосток 	592 069
23 	Ярославль 	591 486
24 	Иркутск 	587 225
25 	Тюмень 	581 758
26 	Махачкала 	577 990
27 	Хабаровск 	577 668
28 	Оренбург 	570 329
29 	Новокузнецк 	547 885
30 	Кемерово 	532 884
31 	Рязань 	525 062
32 	Томск 	522 940
33 	Астрахань 	520 662
34 	Пенза 	519 592
35 	Набережные Челны 	513 242
36 	Липецк 	508 124
37 	Тула 	501 129
38 	Киров 	473 668
39 	Чебоксары 	447 929
40 	Калининград 	431 491
41 	Брянск 	415 640
42 	Курск 	414 595
43 	Иваново 	409 277
44 	Магнитогорск 	408 401
45 	Улан-Удэ 	404 357
46 	Тверь 	403 726
47 	Ставрополь 	398 266
48 	Нижний Тагил 	361 883
49 	Белгород 	356 426
50 	Архангельск 	348 716
51 	Владимир 	348 256
52 	Сочи 	343 285
53 	Курган 	333 640
54 	Смоленск 	326 863
55 	Калуга 	325 185
56 	Чита 	323 964
57 	Орёл 	317 854
58 	Волжский 	314 436
59 	Череповец 	312 311
60 	Владикавказ 	311 635
61 	Мурманск 	307 664
62 	Сургут 	306 703
63 	Вологда 	301 642
64 	Саранск 	297 425
65 	Тамбов 	280 457
66 	Стерлитамак 	273 432
67 	Грозный 	271 596
68 	Якутск 	269 486
69 	Кострома 	268 617
70 	Комсомольск-на-Амуре 	263 906
71 	Петрозаводск 	263 540
72 	Таганрог 	257 692
73 	Нижневартовск 	251 860
74 	Йошкар-Ола 	248 688
75 	Братск 	246 348
76 	Новороссийск 	241 788
77 	Дзержинск 	240 762
78 	Шахты 	240 152
79 	Нальчик 	240 095
80 	Орск 	238 006
81 	Сыктывкар 	235 006
82 	Нижнекамск 	234 108
83 	Ангарск 	233 765
84 	Старый Оскол 	221 163
85 	Великий Новгород 	218 724
86 	Балашиха 	215 353
87 	Благовещенск 	214 397
88 	Прокопьевск 	210 150
89 	Бийск 	210 055
90 	Химки 	207 125
91 	Псков 	203 974
92 	Энгельс 	202 838
93 	Рыбинск 	200 771
94 	Балаково 	199 576
95 	Северодвинск 	192 265
96 	Армавир 	188 897
97 	Подольск 	187 956
98 	Королёв 	183 452
99 	Южно-Сахалинск 	181 727
100 	Петропавловск-Камчатский 	179 526
101 	Сызрань 	178 773
102 	Норильск 	175 301
103 	Златоуст 	174 985
104 	Каменск-Уральский 	174 710
105 	Мытищи 	173 341
106 	Люберцы 	171 978
107 	Волгодонск 	170 621
108 	Новочеркасск 	169 039
109 	Абакан 	165 183
110 	Находка 	159 695
111 	Уссурийск 	157 946
112 	Березники 	156 350
113 	Салават 	156 085
114 	Электросталь 	155 324
115 	Миасс 	151 812
116 	Первоуральск 	149 800
117 	Рубцовск 	147 008
118 	Альметьевск 	146 309
119 	Ковров 	145 492
120 	Коломна 	144 642
121 	Майкоп 	144 246
122 	Пятигорск 	142 397
123 	Одинцово 	139 021
124 	Колпино 	138 013
125 	Копейск 	137 604
126 	Хасавюрт 	133 929
127 	Новомосковск 	131 227
128 	Кисловодск 	128 502
129 	Серпухов 	126 496
130 	Новочебоксарск 	124 094
131 	Нефтеюганск 	123 276
132 	Димитровград 	122 549
133 	Нефтекамск 	121 757
134 	Черкесск 	121 439
135 	Орехово-Зуево 	120 620
136 	Дербент 	119 961
137 	Камышин 	119 924
138 	Невинномысск 	118 351
139 	Красногорск 	116 738
140 	Муром 	116 078
141 	Батайск 	112 400
142 	Новошахтинск 	111 087
143 	Сергиев Посад 	110 878
144 	Ноябрьск 	110 572
145 	Щёлково 	110 380
146 	Кызыл 	109 906
147 	Октябрьский 	109 379
148 	Ачинск 	109 156
149 	Северск 	108 466
150 	Новокуйбышевск 	108 449
151 	Елец 	108 404
152 	Арзамас 	106 367
153 	Обнинск 	104 798
154 	Новый Уренгой 	104 144
155 	Каспийск 	103 914
156 	Элиста 	103 728
157 	Пушкино 	102 840
158 	Жуковский 	102 729
159 	Артём 	102 636
160 	Междуреченск 	101 995
161 	Ленинск-Кузнецкий 	101 666
162 	Сарапул 	101 390
163 	Ессентуки 	100 969
164 	Воткинск 	100 034
165 	Ногинск 	99 762
166 	Тобольск 	99 698
167 	Ухта 	99 642
168 	Серов 	99 381
169 	Бердск 	98 809
170 	Великие Луки 	98 778
171 	Мичуринск 	98 758
172 	Киселёвск 	98 382
173 	Новотроицк 	97 914
174 	Зеленодольск 	97 651
175 	Соликамск 	97 239
176 	Раменское 	96 355
177 	Домодедово 	96 123
178 	Магадан 	95 925
179 	Глазов 	95 835
180 	Каменск-Шахтинский 	95 306
181 	Железногорск 	95 057
182 	Канск 	94 230
183 	Назрань 	93 357
184 	Пушкин 	92 721
185 	Гатчина 	92 566
186 	Саров 	92 073
187 	Новоуральск 	91 813
188 	Воскресенск 	91 301
189 	Долгопрудный 	90 976
190 	Бугульма 	89 144
191 	Кузнецк 	88 886
192 	Губкин 	88 562
193 	Кинешма 	88 113
194 	Ейск 	87 771
195 	Реутов 	87 195
196 	Усть-Илимск 	86 591
197 	Железногорск 	85 559
198 	Усолье-Сибирское 	83 364
199 	Чайковский 	82 933
200 	Азов 	82 882"""
stupid = list()
for i in stupid_list.split('\n'):
	city = i.split('\t')[1][:-1]
	stupid.append(city)
import random 
def get_city(bukva, goroda):
    random.shuffle(stupid)
    for i in stupid:
        if (i[0].lower() == bukva.lower()) and (i not in goroda):
            return(i)
    

